#include "linkedList.h"
void menu(){
	printf("*********************系统功能菜单**********************\n");
    printf("-------------------------------------------------------\n");
    printf("    ***********************************************    \n");
    printf("    *  1.初始化链表       * *    2.销毁链表       *    \n");
    printf("    ***********************************************    \n");
    printf("    *  3.插入节点         * *    4.删除节点取值   *	   \n");
    printf("    ***********************************************	   \n");
    printf("    *  5.输出链表         * *    6.查询数据       *    \n");
    printf("    ***********************************************    \n");
    printf("    *  7.将链表反向       * *    8.判断是否循环   *    \n");
    printf("    ***********************************************    \n");
    printf("    *  9.找到单链表中点   * *    10.奇偶互换      *    \n");
    printf("    ***********************************************    \n");
    printf("    *  11.生成循环链表    * *    12.退出系统      *    \n");
    printf("    ***********************************************    \n");
    printf("-------------------------------------------------------\n");
} 

void operation(){
	//printf("按任意键继续\n");
	system("pause"); //if this operation will input the sentence?
	getchar();
	system("cls");
}
